{
    "0": {
        "num": 0,
        "title": "Top AI and ML Blogs/Websites to Follow in 2022",
        "content":"The topic of artificial intelligence is an interesting one that has and will continue to have a significant influence on our daily lives. So, you can be sure that it will lead to much research during the next ten years. For this reason, it is beneficial to follow several potential AI blogs. Finding trustworthy sources of scientific work is essential for everyone interested in artificial intelligence (AI), from researchers to students, business professionals, and amateurs.\nThis post aims to introduce you to some of the top AI blogs and websites. These blogs may serve as your most satisfactory source for the most recent information on AI or help to keep you informed of developments in this fascinating topic. Please note this is not a ranking article.\n-MIT News\nThe Massachusetts Institute of Technology’s website features a news section devoted to stories on artificial intelligence technology, including its advancement, study, and application. According to the Institute of Technology, its goal is to expand knowledge and instruct students in the science, technology, and other fields that will best serve the country and the rest of the globe in the twenty-first century.\n-Open AI\nOpen AI is the creation of business professionals who “want to offer AI to the public.” It is an organization that conducts AI research and deployment to ensure that AI helps all people and that artificial general intelligence (AGI), a highly autonomous system, can surpass people in the most economically productive work.\n-Amazon Science Blog\nYou may filter by study field on the excellent scientific blog of Amazon Science. Its research focuses on cloud and systems, computer vision, conversational AI, NLP, machine learning, robotics, search and information retrieval, security, privacy, and abuse prevention. Work from Amazon’s science community is included on its blog\n-DeepMind\nWorking on some of the most challenging and fascinating AI problems is DeepMind. Numerous peer-reviewed articles, including those in Nature and Science, have been produced due to their top-notch research.\n-Google AI\nThe research done by Google AI advances the state-of-the-art in the industry. A section of Google devoted entirely to artificial intelligence is called Google AI (sometimes known as Google.ai). Sundar Pichai, CEO of Google, made the announcement during I/O 2017. A portion of the Google AI blog is dedicated to machine learning research.\n-Meta AI Blog\nFacebook (Mets) AI is renowned for conducting cutting-edge research in the area. In addition to human and machine intelligence, their research focuses on computer vision, conversational AI, integrity, NLP, ranking and recommendations, systems research, machine learning theory, voice, and audio. The Facebook AI Blog contains top-notch articles, including blog entries and academic publications.\n-Towards Data Science\nA Medium article called “Towards Data Science” promotes expert discussion and broadens the field’s expertise. Independent writers are invited to submit articles to the website. It’s a reliable tool for data scientists of all experience levels. While being informed of the most significant advancements, you may see what other people in your profession are working on."
    },


    "1": {
        "num": 1,
        "title": "GOOGLE PIXEL BUDS PRO REVIEW: THE SWEET SOUND OF REDEMPTION",
        "content": "It wasn’t a sure thing that the Pixel Buds Pro would turn out to be good. Google has had a mixed, inconsistent track record with wireless earbuds so far. The original Pixel Buds in 2017 had such an unconventional design that something as fundamental as putting them back into the case was overly complicated. The Pixel Buds 2 moved to a much sleeker, true wireless form factor, but they were beset with connectivity issues and frequent audio dropouts. Google righted the ship with the low-end $99 Pixel Buds A-Series last year, but now all eyes are on the new, flagship $199 Pixel Buds Pro — the company’s first earbuds with active noise cancellation — to see whether Google can really hang with the very best from Apple, Sony, Samsung, and others.\n*https://cdn.vox-cdn.com/thumbor/6YScsGm_TyiTpLruM4FImBk6Z7o=/0x0:2040x1360/1120x0/filters:focal(0x0:2040x1360):format(webp):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23905443/DSCF8471.jpg\nTurns out, it very much can. The Pixel Buds Pro fully resolve the Bluetooth woes of the second-gen model while delivering improved sound quality, longer battery life, satisfactory noise cancellation, and bonus convenience features like multipoint. They’re not the smallest or lightest earbuds around, but Google’s elimination of the integrated wing tips (or “stabilizer arcs”) from prior models results in better overall comfort.\nWhen Google announced these earbuds a couple months ago, it made a point to call out the custom silicon and in-house audio processing that were key to developing the Pixel Buds Pro. Every company with earbuds that are the best at something — think noise cancellation in the case of Sony or transparency mode for Apple — builds its own components to achieve that. According to Google, the Pixel Buds Pro include a custom six-core audio chip (not to be confused with the custom Tensor chip in Pixel phones) that powers the active noise cancellation system, and they also use custom 11-millimeter drivers / speakers tuned by the company’s audio team.\nSo then, let’s get right to it: noise cancellation on the Pixel Buds Pro is generally quite good for subduing noise at home, the office, or in a coffee shop. But I do notice that some parts of the frequency spectrum (like street noise from passing cars) cut through louder than they would on the AirPods Pro or Sony’s WF-1000XM4 buds. Since the ANC runs on Google-developed algorithms, it’s feasible that firmware updates could further enhance the noise-canceling strength of the Buds Pro. As it stands today, the ANC is more than competent — even if it won’t be bumping Sony or Bose from the top of the mountain.\n*https://cdn.vox-cdn.com/thumbor/S4dpezEzlKAhmFweq5BPi4-GUXM=/0x0:2040x1360/1720x0/filters:focal(0x0:2040x1360):format(webp):no_upscale()/cdn.vox-cdn.com/uploads/chorus_asset/file/23905452/DSCF8484_2.jpg\nEven with all the praise, there’ve been occasional bugs. I’ve had (very) rare instances where audio breaks down and gets unlistenable while watching a video when using multipoint, or the stereo imaging of the earbuds gets thrown out of whack after I manually disconnect one of the two devices. These glitches aren’t unheard of when using true wireless earbuds, and Google has some early kinks to iron out. But on the whole, I’m much more confident in recommending the Pixel Buds Pro than any of the company’s prior efforts, and that boils down to their rock-solid overall connection stability.\nThe Pixel Buds Pro are Google’s best set of earbuds yet. They’ve shed the connectivity flaws that sank the second-gen model while adding respectable active noise cancellation, longer battery life, and superior sound. And the inclusion of multipoint makes them genuinely more useful day to day. Like any pricey earbuds, you’ll want to try them on for yourself to get a feel for the fit. But assuming the new, bulkier design jibes with your ears, Google finally has a full-featured, flagship pair of earbuds that Pixel fans can enjoy without any back-of-mind reservations or second thoughts — just as it ought to be for $200."
    },


    "2": {
        "num": 2,
        "title": "Amazon’s shares rise on earnings beat, despite $2B loss",
        "content": "E-commerce giant Amazon reported its second-quarter results today, and despite inflation and a net loss of $2 billion, the results were surprisingly better than expected. Much of the loss is chalked up to Amazon’s stake in Rivian. The second quarter net loss is compared to the net income of $7.8 billion in Q2 2021.\nSales increased 7% to $121.2 billion in the second quarter, compared with $113.1 billion in the same period in 2021. This was better than Wall Street’s estimate of $119.3 billion. The company predicted revenue between $116 billion and $121 billion for the quarter.\nBecause of the slightly good news, Amazon shares increased 11% in late trading on Thursday.\nIt’s important to note that online store sales fell 4.3% to $50.89 billion. Street only estimated an approximate 2% decline.\n“Despite continued inflationary pressures in fuel, energy, and transportation costs, we’re making progress on the more controllable costs we referenced last quarter, particularly improving the productivity of our fulfillment network,” said Andy Jassy, Amazon CEO, in the company’s earnings release.\nLooking at other figures, ad sales were higher this quarter, at $8.76 billion, up 4.3%. This is spot on with projections. The company’s advertising arm is essential and was projected to hit $8.7 billion in revenue, up 21% from the previous year.\nAmazon Web Services (AWS), the company’s cloud-computing unit, contributed $19.74 billion, a 33% jump from last year. AWS is an asset to the company, and during the first quarter, it grew 35%. The future of Amazon’s cloud business is key, as the looming recession will likely cause a decline in corporate spending on cloud services.\nThe retail industry has seen its fair share of bad news recently, with Walmart decreasing its second-quarter and full-year guidance, saying food inflation is limiting consumer spending on nonessential items. Shopify laid off 10% of its staff due to slowing revenue growth.\nTech companies have also been going through it. Google parent Alphabet and Microsoft reported earnings this week that missed Wall Street’s expectations. Also, Facebook-owner Meta reported its first-ever year-over-year revenue drop.\n"
    },


    "3": {
        "num": 3,
        "title": "How to Recognize a Werewolf, c. 1340",
        "content": "Lycanthropy is a kind of melancholy making the affected persons wander at night-time, visiting the tombs and the deserts like wolves, and come back in the morning as their human figure and stay at home. In any case, they have ulcerated legs and feet because of falls on stones and thorns; they have dry eyes and tongue and feeble vision… Some patients avoid speaking and remain silent and sad while others try to converse with people.\nJohannes Actuarius, Therapeutike Methodos\n*https://askthepast.net/assets/images/wolfman.png\nWerewolf diagnosis is tricky! Look for dry eyes, dry mouth, and [checks notes] ah yes, visiting tombs at night and returning in human form in the morning."
    },
    "4": {
        "num": 4,
        "title": "Programming languages endorsed for server-side use at Meta",
        "content": "At Meta, we use many different programming languages for a wide variety of platforms and use cases. Supporting a new language is not a decision we make lightly. It’s important that every language we adopt is the best fit for a particular use case, so we do a high level of diligence whenever we evaluate a language. Language decisions tend to stick once they’re made, so we want to be deliberate from the onset to give our engineers the best tools to work with.\nToday, we’re sharing insights into our internal guidance on the various languages that play an important role at Meta — and specifically our server-side programming languages, to which Rust is the latest addition.\n-What is a supported language at Meta?\nIf a language is supported, developers can count on getting a good experience with code editing, debugging, build, and deployment, as well as core libraries and interoperability. Developers can also count on that experience not going away — they won’t be asked to move off a supported language. For most cases, Meta recommends choosing a supported language for new projects and services.\nFully supporting a language is a major investment for Meta, so “long tail” languages are community supported. For those languages, there are far fewer guarantees, and teams adopting them will have to take on the maintenance burden. In most cases, teams should avoid using them for new applications, unless a team already has a significant investment in the language.\n-Meta’s primary supported server-side languages are Hack, C++, Rust, and Python.\nFor performance-sensitive back-end services, we encourage C++ and Rust. Rust is a new addition to this list. There’s a rapidly increasing Rust footprint in our products and services, and we’re committing to Rust long-term and welcome early adopters.\nFor CLI tools, we recommend Rust. This is a new recommendation for this year.\nFor business logic and relatively stateless applications, the Hack ecosystem has the highest level of automation and support at Meta and is the recommended language.\nFinally, Meta continues to heavily support our Python developers. For data science, ML applications, and Instagram, Python continues to be the language of choice, and we continue to invest in the experience with this ecosystem.\nFor specific use cases, we support other languages, including Java, Erlang, Haskell, and Go. These languages are currently not widely supported outside of specific use cases.\n-Rust is the latest server-side language at Meta\nSince we began our journey with Rust, the number of projects using Rust inside Meta has increased at an accelerated rate. We’re excited to see Rust added to this list of server-side supported languages, giving our engineers more tools, flexibility, and support for their work. Meta is committed to provide long-term support for programming languages used by our developer, and this move signals Meta’s long-term commitment and support for the Rust language ecosystem."
    },
    "5": {
        "num": 5,
        "title": "Homelander",
        "content": "Is your idiot brain getting fucked by stupid"
    },
    "6": {
        "num": 6,
        "title": "only says woof",
        "content": "woof woof woof."
    }
}

